Repository: darviarush/perl-aion-emitter
Catalog: i18n/Aion/Emitter.*.po
Languages: ru_en

source: Aion::Emitter - диспетчер событий
ru_en: Aion::Emitter - event dispatcher

source: Файл lib/Event/BallEvent.pm:
ru_en: File lib/Event/BallEvent.pm:

source: Файл lib/Listener/RadiusListener.pm:
ru_en: File lib/Listener/RadiusListener.pm:

source: Файл lib/Listener/WeightListener.pm:
ru_en: File lib/Listener/WeightListener.pm:

source: Файл etc/annotation/listen.ann:
ru_en: File etc/annotation/listen.ann:

source: Данный диспетчер событий реализует паттерн **Event Dispatcher** в котором событие определяется по классу объекта события (event).
ru_en: This event dispatcher implements the **Event Dispatcher** pattern in which an event is defined by the class of the event object (event).

source: Слушатель регистрируется как эон в плероме и будет всегда представлен одним объектом.
ru_en: The listener is registered as an aeon in the pleroma and will always be represented by one object.

source: Метод обрабатывающий события отмечается аннотацией `#@listen`.
ru_en: The event processing method is marked with the `#@listen` annotation.

source: Излучает событие: вызывает все слушатели связанные с событием `$event`.
ru_en: Emits an event: calls all listeners associated with the `$event` event.

source: Дополнительный параметр `$key` позволяет указать уточняющее событие. Представьте, что у нас множество контроллеров и мы хотим излучить событие не для всех, а для каждого конкретного контроллера. Писать для каждого контроллера класс расширяющий класс запроса – расточительно.
ru_en: The additional parameter `$key` allows you to specify a qualifying event. Imagine that we have many controllers and we want to emit an event not for all, but for each specific controller. Writing a class that extends the request class for each controller is wasteful.

source: `$key` может содержать буквы, цифры, подчёркивание, тире, двоеточие и точку.
ru_en: `$key` can contain letters, numbers, underscores, dashes, colons and periods.
